#include <SFML/Graphics.hpp>

const int HEIGHT_MAP = 40;  // размер карты высота
const int WIDTH_MAP = 50;   // размер карты ширина

sf::Texture mapTexture;  // текстура карты
sf::Sprite s_map;        // спрайт карты

std::string TileMap[HEIGHT_MAP] = {
    "0000000000000000000000000000000000000000",
    "0                                      0",
    "0                                      0",
    "0              0000000000              0",
    "0              0ssssssss0              0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0                                      0",
    "0000000000000000000000000000000000000000",

};
